Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Fixed some :ref:`addons` trigger upon installation.
sv: Fixade nÃ¥gra :ref:`addons`-triggers vid installation.

source: Fixed restoring of Git repositories from :ref:`projectbackup`.
sv: Fast Ã¥terstÃ¤llning av Git-arkiv frÃ¥n :ref:`projectbackup`.

source: Weblate has switched to a different library for zxcvbn integration, as the old one is no longer maintained, see :ref:`password-authentication`.
sv: Weblate har bytt till ett annat bibliotek fÃ¶r zxcvbn-integration, eftersom det gamla inte lÃ¤ngre underhÃ¥lls, se :ref:`password-authentication`.

source: Weblate uses proactive authentication with Git 2.46.0 and newer when HTTP credentials are supplied.
sv: Weblate anvÃ¤nder proaktiv autentisering med Git 2.46.0 och nyare nÃ¤r HTTP-autentiseringsuppgifter anges.

source: There are several changes in :file:`settings_example.py`, most notable are changed settings ``AUTH_PASSWORD_VALIDATORS`` and ``INSTALLED_APPS``; please adjust your settings accordingly.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, de mest anmÃ¤rkningsvÃ¤rda Ã¤r Ã¤ndrade instÃ¤llningar ``AUTH_PASSWORD_VALIDATORS`` och ``INSTALLED_APPS``; justera dina instÃ¤llningar dÃ¤refter.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/138?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/138?closed=1>`__.

source: *Released on February 21st 2025.*
sv: *SlÃ¤pptes den 21 februari 2025.*

source: :ref:`check-multiple-failures` better shows failing checks including links to the strings.
sv: :ref:`check-multiple-failures` visar bÃ¤ttre misslyckade kontroller inklusive lÃ¤nkar till strÃ¤ngarna.

source: Detailed overview of locked components on project repository management.
sv: Detaljerad Ã¶versikt Ã¶ver lÃ¥sta komponenter i projektets repositoriehantering.

source: :ref:`search-strings` supports searching by source string state.
sv: :ref:`search-strings` stÃ¶der sÃ¶kning efter kÃ¤llstrÃ¤ngens tillstÃ¥nd.

source: :ref:`download` performs faster on project and language scopes.
sv: :ref:`download` fungerar snabbare pÃ¥ projekt- och sprÃ¥knivÃ¥.

source: :ref:`zen-mode` does not display the source string twice when editing it.
sv: :ref:`zen-mode` visar inte kÃ¤llstrÃ¤ngen tvÃ¥ gÃ¥nger nÃ¤r den redigeras.

source: Fixed :ref:`glossary` terms highlighting.
sv: Fixat :ref:`glossary`-termernas markering.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/137?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/137?closed=1>`__.

source: *Released on February 14th 2025.*
sv: *SlÃ¤pptes den 14 februari 2025.*

source: :ref:`check-rst-references` check to validate reStructuredText references.
sv: :ref:`check-rst-references` kontrollera fÃ¶r att validera reStructuredText-referenser.

source: :ref:`check-rst-syntax` check to validate reStructuredText syntax.
sv: :ref:`check-rst-syntax` kontrollera fÃ¶r att validera reStructuredText-syntax.

source: API can now produce CSV output.
sv: API kan nu producera CSV-utdata.

source: New management command :wladmin:`import_projectbackup` to import :ref:`projectbackup`.
sv: Nytt administrationskommando :wladmin:`import_projectbackup` fÃ¶r att importera :ref:`projectbackup`.

source: Improved error handling in :ref:`machine-translation-setup`.
sv: FÃ¶rbÃ¤ttrad felhantering i :ref:`machine-translation-setup`.

source: :envvar:`WEBLATE_REGISTRATION_CAPTCHA` is now available in Docker container.
sv: :envvar:`WEBLATE_REGISTRATION_CAPTCHA` Ã¤r nu tillgÃ¤ngligt i Docker-containern.

source: :guilabel:`Synchronize` on shared repository now operates on all its components.
sv: :guilabel:`Synkronisera` pÃ¥ delat arkiv fungerar nu pÃ¥ alla dess komponenter.

source: :ref:`check-punctuation-spacing` ignores markup such as Markdown or reStructuredText.
sv: :ref:`check-punctuation-spacing` ignorerar markeringar som Markdown eller reStructuredText.

source: :ref:`autofix-punctuation-spacing` does not alter reStructuredText markup.
sv: :ref:`autofix-punctuation-spacing` Ã¤ndrar inte reStructuredText-markeringen.

source: Improved validation errors in :doc:`/api`, see :ref:`api-errors`.
sv: FÃ¶rbÃ¤ttrade valideringsfel i :doc:`/api`, se :ref:`api-errors`.

source: Any language changed into an alias in `Weblate language data <https://github.com/WeblateOrg/language-data/>`__ is now reflected in all existing installations.
sv: Alla sprÃ¥k som Ã¤ndrats till ett alias i `Weblate-sprÃ¥kdata <https://github.com/WeblateOrg/language-data/>`__ Ã¥terspeglas nu i alla befintliga installationer.

source: Blank alias languages (not linked to any translation, profile, component, ...) are now automatically removed.
sv: Tomma alias-sprÃ¥k (som inte Ã¤r kopplade till nÃ¥gon Ã¶versÃ¤ttning, profil, komponent osv.) tas nu bort automatiskt.

source: :ref:`check-duplicate` better works with markup such as Markdown or reStructuredText.
sv: :ref:`check-duplicate` fungerar bÃ¤ttre med markup som Markdown eller reStructuredText.

source: Automatically use DeepL API Free endpoint for the DeepL API Free authentication keys in :ref:`mt-deepl`.
sv: AnvÃ¤nd automatiskt DeepL API Free-slutpunkt fÃ¶r DeepL API Free-autentiseringsnycklarna i :ref:`mt-deepl`.

source: Compatibility with third-party static files storage backends for Django.
sv: Kompatibilitet med tredjepartsbackend fÃ¶r lagring av statiska filer fÃ¶r Django.

source: Improved language compatibility in :ref:`mt-microsoft-translator`.
sv: FÃ¶rbÃ¤ttrad sprÃ¥kkompatibilitet i :ref:`mt-microsoft-translator`.

source: :ref:`check-reused` check gracefully handles languages which are not case sensitive.
sv: :ref:`check-reused` hanterar elegant sprÃ¥k som inte Ã¤r skiftlÃ¤geskÃ¤nsliga.

source: :ref:`component-enforced_checks` are now applied on strings imported from the repository.
sv: :ref:`component-enforced_checks` tillÃ¤mpas nu pÃ¥ strÃ¤ngar som importeras frÃ¥n arkivet.

source: Reduced false positives in :ref:`check-end-colon` and :ref:`check-end-stop` for CJK languages.
sv: Minskat antal falska positiva resultat i :ref:`check-end-colon` och :ref:`check-end-stop` fÃ¶r CJK-sprÃ¥k.

source: OpenAPI schema for API includes more information.
sv: OpenAPI-schemat fÃ¶r API innehÃ¥ller mer information.

source: :ref:`check-regex` supports advanced regular expressions.
sv: :ref:`check-regex` stÃ¶der avancerade reguljÃ¤ra uttryck.

source: :ref:`check-same` gracefully deals with case-insensitive languages.
sv: :ref:`check-same` hanterar elegant sprÃ¥k som inte skiljer mellan versaler och gemener.

source: :ref:`check-reused` wrongly triggered after fixing the error.
sv: :ref:`check-reused` utlÃ¶stes felaktigt efter att felet hade Ã¥tgÃ¤rdats.

source: Dark theme behavior in some situations.
sv: MÃ¶rkt tema beteende i vissa situationer.

source: Translation propagation sometimes did not work as expected.
sv: ÃversÃ¤ttningsspridningen fungerade ibland inte som fÃ¶rvÃ¤ntat.

source: :http:header:`Content-Security-Policy` is now automatically set for AWS.
sv: :http:header:`Content-Security-Policy` stÃ¤lls nu in automatiskt fÃ¶r AWS.

source: :ref:`machine-translation-setup` sometimes cached results too aggressively.
sv: :ref:`machine-translation-setup` cachade ibland resultaten fÃ¶r aggressivt.

source: Fixed translations caching in :ref:`machine-translation-setup`.
sv: Fixade Ã¶versÃ¤ttningscaching i :ref:`machine-translation-setup`.

source: :ref:`autofix-html` automatic fixups honors the ``ignore-safe-html`` flag.
sv: :ref:`autofix-html` automatiska korrigeringar respekterar flaggan ``ignore-safe-html``.

source: :ref:`check-punctuation-spacing` no longer applies to Breton.
sv: :ref:`check-punctuation-spacing` gÃ¤ller inte lÃ¤ngre fÃ¶r bretonska.

source: Fixed :ref:`addon-weblate.git.squash` on linked repositories.
sv: Fixat :ref:`addon-weblate.git.squash` pÃ¥ lÃ¤nkade arkiv.

source: :ref:`check-multiple-failures` avoids false positives and better lists related checks.
sv: :ref:`check-multiple-failures` undviker falska positiva resultat och listar relaterade kontroller pÃ¥ ett bÃ¤ttre sÃ¤tt.

source: Running tests using Django test executor is no longer supported, see :doc:`/contributing/tests`.
sv: Det gÃ¥r inte lÃ¤ngre att kÃ¶ra tester med Djangos testkÃ¶rare. Se :doc:`/contributing/tests`.

source: :ref:`check-bbcode` check is now disabled by default. The ``bbcode-text`` flag is required to activate this check, see :ref:`custom-checks`.
sv: :ref:`check-bbcode`-kontrollen Ã¤r nu inaktiverad som standard. Flaggan ``bbcode-text`` krÃ¤vs fÃ¶r att aktivera denna kontroll, se :ref:`custom-checks`.

source: API error responses format has changed, see :ref:`api-errors`.
sv: Formatet fÃ¶r API-felmeddelanden har Ã¤ndrats, se :ref:`api-errors`.

source: There are several changes in :file:`settings_example.py`, most notable are the new settings for :ref:`api` in ``REST_FRAMEWORK``, ``SPECTACULAR_SETTINGS``, ``DRF_STANDARDIZED_ERRORS`` and ``INSTALLED_APPS``; please adjust your settings accordingly.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, de mest anmÃ¤rkningsvÃ¤rda Ã¤r de nya instÃ¤llningarna fÃ¶r :ref:`api` i ``REST_FRAMEWORK``, ``SPECTACULAR_SETTINGS``, ``DRF_STANDARDIZED_ERRORS`` och ``INSTALLED_APPS``; justera dina instÃ¤llningar dÃ¤refter.

source: PostgreSQL 12 and MariaDB 10.4 are no longer supported.
sv: PostgreSQL 12 och MariaDB 10.4 stÃ¶ds inte lÃ¤ngre.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/133?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/133?closed=1>`__.

source: *Released on December 19th 2024.*
sv: *SlÃ¤pptes den 19 december 2024.*

source: Renamed :ref:`vcs-bitbucket-data-center` to match new product name.
sv: OmdÃ¶pt :ref:`vcs-bitbucket-data-center` fÃ¶r att matcha det nya produktnamnet.

source: :http:get:`/api/users/` supports searching by user ID.
sv: :http:get:`/api/users/` stÃ¶der sÃ¶kning efter anvÃ¤ndar-ID.

source: Avoid query parser crash in multi-threaded environments.
sv: Undvik att frÃ¥geparsern kraschar i flertrÃ¥diga miljÃ¶er.

source: Avoid :ref:`autofix` crash on multi-value strings.
sv: Undvik :ref:`autofix`-krasch pÃ¥ strÃ¤ngar med flera vÃ¤rden.

source: Make project tokens work when :ref:`2fa` or :ref:`component-agreement` are enforced.
sv: FÃ¥ projekttoken att fungera nÃ¤r :ref:`2fa` eller :ref:`component-agreement` tillÃ¤mpas.

source: Captcha solution were sometimes not accepted.
sv: Captcha-lÃ¶sningen accepterades ibland inte.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/135?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/135?closed=1>`__.

source: *Released on December 16th 2024.*
sv: *SlÃ¤pptes den 16 december 2024.*

source: Fixed publishing package to PyPI.
sv: Fixat publiceringspaket till PyPI.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/134?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/134?closed=1>`__.

source: Per-project :ref:`machine-translation-setup` can now be configured via the Project :ref:`api`.
sv: Per-projekt :ref:`machine-translation-setup` kan nu konfigureras via Projekt :ref:`api`.

source: Added :http:get:`/api/projects/{string:project}/machinery_settings/`.
sv: Tillagt :http:get:`/api/projects/{string:project}/machinery_settings/`.

source: Added :http:post:`/api/projects/{string:project}/machinery_settings/`.
sv: Tillagt :http:post:`/api/projects/{string:project}/machinery_settings/`.

source: Translation memory import now supports files with XLIFF, PO and CSV formats, see :ref:`memory-user` and :wladmin:`import_memory` command in :ref:`manage`.
sv: ÃversÃ¤ttningsminnesimport stÃ¶der nu filer i formaten XLIFF, PO och CSV, se :ref:`memory-user` och :wladmin:`import_memory`-kommandot i :ref:`manage`.

source: The registration CAPTCHA now includes proof-of-work mechanism ALTCHA.
sv: Registrerings-CAPTCHA inkluderar nu arbetsbevismekanismen ALTCHA.

source: Leading problematic characters in CSV are now checks for :ref:`glossary`, see :ref:`check-prohibited-initial-character`.
sv: Ledande problematiska tecken i CSV kontrolleras nu fÃ¶r :ref:`glossary`, se :ref:`check-prohibited-initial-character`.

source: Logging to :ref:`graylog`.
sv: Logga in pÃ¥ :ref:`graylog`.

source: :ref:`mt-google-translate-api-v3` now supports :ref:`glossary-mt` (optional).
sv: :ref:`mt-google-translate-api-v3` stÃ¶der nu :ref:`glossary-mt` (valfritt).

source: A shortcut to duplicate a component is now available directly in the menu (:guilabel:`Operations` â :guilabel:`Duplicate this component`).
sv: En genvÃ¤g fÃ¶r att duplicera en komponent finns nu direkt i menyn (:guilabel:`Operations` â :guilabel:`Duplicate this component`).

source: Included username when generating :ref:`credits`.
sv: Inkluderat anvÃ¤ndarnamn vid generering av :ref:`credits`.

source: :ref:`bulk-edit` shows a preview of matched strings.
sv: :ref:`bulk-edit` visar en fÃ¶rhandsgranskning av matchande strÃ¤ngar.

source: :http:get:`/api/components/(string:project)/(string:component)/` exposes component lock state.
sv: :http:get:`/api/components/(string:project)/(string:component)/` visar komponentens lÃ¥sstatus.

source: Editor in :ref:`zen-mode` is now stick to bottom of screen.
sv: RedaktÃ¶ren i :ref:`zen-mode` fastnar nu lÃ¤ngst ner pÃ¥ skÃ¤rmen.

source: Added page navigation while :ref:`translating`.
sv: Lade till sidnavigering under :ref:`translating`.

source: :ref:`manage-appearance` now has distinct settings for dark mode.
sv: :ref:`manage-appearance` har nu separata instÃ¤llningar fÃ¶r mÃ¶rkt lÃ¤ge.

source: Improved :ref:`translation-propagation` performance.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r :ref:`translation-propagation`.

source: More detailed error messages for :http:post:`/api/translations/(string:project)/(string:component)/(string:language)/file/`.
sv: Mer detaljerade felmeddelanden fÃ¶r :http:post:`/api/translations/(string:project)/(string:component)/(string:language)/file/`.

source: Using the ``has:variant`` field now correctly displays strings that have variants in the search language, see :ref:`search-strings`.
sv: Genom att anvÃ¤nda fÃ¤ltet ``has:variant`` visas nu korrekt strÃ¤ngar som har varianter i sÃ¶ksprÃ¥ket, se :ref:`search-strings`.

source: Saving newly added strings in some formats.
sv: Spara nyligen tillagda strÃ¤ngar i vissa format.

source: :ref:`check-java-printf-format` gracefully handles escaping.
sv: :ref:`check-java-printf-format` hanterar elegant escape-tecken.

source: :ref:`rollbar-errors` integration no longer includes client-side error collection.
sv: :ref:`rollbar-errors`-integrationen inkluderar inte lÃ¤ngre insamling av fel pÃ¥ klientsidan.

source: Weblate now requires Git 2.28 or newer.
sv: Weblate krÃ¤ver nu Git 2.28 eller nyare.

source: Any custom code that relied on ``Change`` models signals should be reviewed.
sv: All anpassad kod som Ã¤r beroende av signaler frÃ¥n ``Change``-modeller bÃ¶r granskas.

source: :ref:`fedora-messaging` integration needs to be updated to be compatible with this release.
sv: :ref:`fedora-messaging`-integrationen mÃ¥ste uppdateras fÃ¶r att vara kompatibel med denna version.

source: :envvar:`WEB_WORKERS` now configures number of threads instead of processes.
sv: :envvar:`WEB_WORKERS` konfigurerar nu antalet trÃ¥dar istÃ¤llet fÃ¶r processer.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/127?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/127?closed=1>`__.

source: *Released on November 19th 2024.*
sv: *SlÃ¤pptes den 19 november 2024.*

source: :ref:`search-users` can search based on user changes.
sv: :ref:`search-users` kan sÃ¶ka baserat pÃ¥ anvÃ¤ndarÃ¤ndringar.

source: Fixed occasional crash in :ref:`rss`.
sv: Fixat sporadiska krascher i :ref:`rss`.

source: :ref:`check-icu-message-format` gracefully handles plural strings.
sv: :ref:`check-icu-message-format` hanterar flertalsstrÃ¤ngar pÃ¥ ett elegant sÃ¤tt.

source: :ref:`vcs-bitbucket-cloud` correctly generates pull request description.
sv: :ref:`vcs-bitbucket-cloud` genererar korrekt beskrivning av pull-fÃ¶rfrÃ¥gan.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/132?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/132?closed=1>`__.

source: *Released on November 6th 2024.*
sv: *SlÃ¤pptes den 6 november 2024.*

source: Formatting of some :ref:`audit-log` entries.
sv: Formatering av vissa :ref:`audit-log`-poster.

source: Fixed XML escaped output in some machine translation integrations.
sv: Fixade XML-escaped-utdata i vissa maskinÃ¶versÃ¤ttningsintegrationer.

source: Fixed duplicate listing of newly added glossary terms.
sv: Fixat dubblettlistning av nyligen tillagda ordlista termer.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/131?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/131?closed=1>`__.

source: *Released on November 1st 2024.*
sv: *SlÃ¤pptes den 1 november 2024.*

source: Update outdated plural definitions during the database migration.
sv: Uppdatera fÃ¶rÃ¥ldrade pluraldefinitioner under databasmigreringen.

source: Reduced number of database queries when updating multiple strings.
sv: Minskat antal databasfrÃ¥gor vid uppdatering av flera strÃ¤ngar.

source: Leading problematic characters in :ref:`glossary` terms are now properly stripped in uploaded files.
sv: Ledande problematiska tecken i :ref:`glossary`-termer tas nu bort pÃ¥ rÃ¤tt sÃ¤tt i uppladdade filer.

source: Improved :ref:`workflow-customization` performance.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r :ref:`workflow-customization`.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/129?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/129?closed=1>`__.

source: *Released on October 15th 2024.*
sv: *SlÃ¤pptes den 15 oktober 2024.*

source: Use lower case name for the Python package.
sv: AnvÃ¤nd smÃ¥ bokstÃ¤ver fÃ¶r namnet pÃ¥ Python-paketet.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/128?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/128?closed=1>`__.

source: Added :ref:`component-key_filter` in the component.
sv: Lade till :ref:`component-key_filter` i komponenten.

source: :doc:`/user/search` now supports filtering by object path and :ref:`date-search`.
sv: :doc:`/user/search` stÃ¶der nu filtrering efter objektvÃ¤g och :ref:`date-search`.

source: Merge requests credentials can now be passed in the repository URL, see :ref:`settings-credentials`.
sv: Inloggningsuppgifter fÃ¶r sammanslagningsfÃ¶rfrÃ¥gningar kan nu skickas i repositoriets URL, se :ref:`settings-credentials`.

source: :ref:`mt-azure-openai` automatic suggestion service.
sv: :ref:`mt-azure-openai` automatisk fÃ¶rslagstjÃ¤nst.

source: :ref:`mt-modernmt` supports :ref:`glossary-mt`.
sv: :ref:`mt-modernmt` stÃ¶der :ref:`glossary-mt`.

source: :ref:`mt-deepl` now supports specifying translation context.
sv: :ref:`mt-deepl` stÃ¶der nu specificering av Ã¶versÃ¤ttningskontext.

source: :ref:`mt-aws` now supports :ref:`glossary-mt`.
sv: :ref:`mt-aws` stÃ¶der nu :ref:`glossary-mt`.

source: :ref:`autofix` for Devanagari danda now better handles latin script.
sv: :ref:`autofix` fÃ¶r Devanagari danda hanterar nu latinska tecken bÃ¤ttre.

source: :ref:`autofix` for French and Breton now uses a non-breaking space before colons instead of a narrow one.
sv: :ref:`autofix` fÃ¶r franska och bretonska anvÃ¤nder nu ett icke-brytande mellanslag fÃ¶re kolon istÃ¤llet fÃ¶r ett smalt.

source: :ref:`api` now has a preview OpenAPI specification.
sv: :ref:`api` har nu en fÃ¶rhandsgranskning av OpenAPI-specifikationen.

source: Stale, empty glossaries are now automatically removed.
sv: FÃ¶rÃ¥ldrade, tomma ordlistor tas nu bort automatiskt.

source: :kbd:`?` now displays available :ref:`keyboard`.
sv: :kbd:`?` visar nu tillgÃ¤ngliga :ref:`keyboard`.

source: Translation and language view in the project now include basic information about the language and plurals.
sv: ÃversÃ¤ttning och sprÃ¥kvy i projektet innehÃ¥ller nu grundlÃ¤ggande information om sprÃ¥ket och pluralformer.

source: :ref:`search-replace` shows a preview of matched strings.
sv: :ref:`search-replace` visar en fÃ¶rhandsgranskning av matchande strÃ¤ngar.

source: :ref:`aresource` now support translatable attribute in its strings.
sv: :ref:`aresource` stÃ¶der nu Ã¶versÃ¤ttningsbara attribut i sina strÃ¤ngar.

source: Creating component via file upload (Translate document) now supports bilingual files.
sv: Skapande av komponenter via filuppladdning (ÃversÃ¤tt dokument) stÃ¶der nu tvÃ¥sprÃ¥kiga filer.

source: Displaying :ref:`workflow-customization` setting in some cases.
sv: Visar instÃ¤llningen :ref:`workflow-customization` i vissa fall.

source: Users can add component in any language already existing in a project.
sv: AnvÃ¤ndare kan lÃ¤gga till komponenter pÃ¥ vilket sprÃ¥k som helst som redan finns i ett projekt.

source: :ref:`check-unnamed-format` better handles some strings, such as :ref:`check-python-brace-format`.
sv: :ref:`check-unnamed-format` hanterar vissa strÃ¤ngar bÃ¤ttre, till exempel :ref:`check-python-brace-format`.

source: Weblate now requires Python 3.11 or newer.
sv: Weblate krÃ¤ver nu Python 3.11 eller nyare.

source: :ref:`mt-aws` now requires the ``TranslateFullAccess`` permission.
sv: :ref:`mt-aws` krÃ¤ver nu behÃ¶righeten ``TranslateFullAccess``.

source: There are several changes in :file:`settings_example.py`, most notable are the new settings for :ref:`api` in ``SPECTACULAR_SETTINGS`` and changes in ``REST_FRAMEWORK`` and ``INSTALLED_APPS``; please adjust your settings accordingly.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, de mest anmÃ¤rkningsvÃ¤rda Ã¤r de nya instÃ¤llningarna fÃ¶r :ref:`api` i ``SPECTACULAR_SETTINGS`` och Ã¤ndringar i ``REST_FRAMEWORK`` och ``INSTALLED_APPS``; justera dina instÃ¤llningar dÃ¤refter.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/122?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/122?closed=1>`__.

source: *Released on September 5th 2024.*
sv: *SlÃ¤pptes den 5 september 2024.*

source: :ref:`2fa` remembers last method used by user.
sv: :ref:`2fa` kommer ihÃ¥g den senaste metoden som anvÃ¤ndaren anvÃ¤nde.

source: Instead of redirecting, the sign-out now displays a page.
sv: IstÃ¤llet fÃ¶r att omdirigera visas nu en sida nÃ¤r du loggar ut.

source: Improved readability of exception logs.
sv: FÃ¶rbÃ¤ttrad lÃ¤sbarhet av undantagsloggar.

source: Updating of translations from the repository in linked components.
sv: Uppdatering av Ã¶versÃ¤ttningar frÃ¥n arkivet i lÃ¤nkade komponenter.

source: Improved rendering of digest notification e-mails.
sv: FÃ¶rbÃ¤ttrad Ã¥tergivning av e-postmeddelanden med sammanfattningar.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/126?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/126?closed=1>`__.

source: *Released on August 30th 2024.*
sv: *SlÃ¤pptes den 30 augusti 2024.*

source: Updated language names to better describe different scripts and Sinitic languages.
sv: SprÃ¥knamn har uppdaterats fÃ¶r att bÃ¤ttre beskriva olika skriftsystem och sinitiska sprÃ¥k.
